marshalltaylor/stm32f446_devel/bsp_sliders/UserProject/Core/Inc/usart.h
/**
  ******************************************************************************
  * File Name          : USART.h
  * Description        : This file provides code for the configuration
  *                      of the USART instances.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __usart_H
#define __usart_H
#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "main_cubemx.h"

/* USER CODE BEGIN Includes */
#include <stdbool.h>
/* USER CODE END Includes */

extern UART_HandleTypeDef huart2;
extern UART_HandleTypeDef huart6;

/* USER CODE BEGIN Private defines */
#define TX_BUFFER_SIZE 256
#define RX_BUFFER_SIZE 256

#define UARTS_MONITORED 7

typedef struct UartInstance
{
	UART_HandleTypeDef* huart;
	DMA_HandleTypeDef* hdma_rx;
	DMA_HandleTypeDef* hdma_tx;

	bool UartTxInProgress;

	volatile uint8_t txDataBuffer[TX_BUFFER_SIZE+10];
	volatile int16_t txDataBuffer_head;
	volatile int16_t txDataBuffer_next;
	volatile int16_t txDataBuffer_tail;

	volatile uint8_t rxCharBuffer;
	volatile uint8_t rxDataBuffer[RX_BUFFER_SIZE+10];
	volatile int16_t rxDataBuffer_first;
	volatile int16_t rxDataBuffer_last;
} UartInstance_t;

/* USER CODE END Private defines */

extern void _Error_Handler(char *, int);

// Called from hal init
void MX_USART2_UART_Init(void);
void MX_USART6_UART_Init(void);

/* USER CODE BEGIN Prototypes */

// Write a byte to the passed UartInstance_t
void halUartWrite(uint8_t data, UartInstance_t * UART);

// Look at "first" rxDataBuffer value
uint8_t halUartPeek(UartInstance_t * UART);

// Look at "first" and advance ptr if not end
uint8_t halUartRead(UartInstance_t * UART);

// Get number of bytes read.
// This should be used to check if data is available before using
// the other usart routines. 
uint16_t halUartReadBytesAvailable(UartInstance_t * UART);

// Reconfig interrupt or whatever.
void emergencyRestart(void);
void restartHuartIfNeeded(void);

/* USER CODE END Prototypes */

#ifdef __cplusplus
}
#endif
#endif /*__ usart_H */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
